; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v5 ?v1)
             (pred_1 ?v10 ?v12)
             (pred_2 ?v5 ?v12)
             (pred_5 ?v7 ?v5 )
	     (pred_8 ?v5)
             (pred_12 ?v9)
             (pred_11 ?v10)
             (pred_7 ?v12)
             (pred_10 ?v5)
             (pred_4 ?v10)
             (pred_6 ?v5)
             (pred_3 ))



(:action op_5
:parameters (?v13 ?v4 ?v2 ?v3)
:precondition (and (pred_12 ?v13) (pred_12 ?v4) (pred_11 ?v2) (pred_7 ?v3)
          (pred_9 ?v13 ?v4) (pred_1 ?v2 ?v3)
                   (pred_2 ?v4 ?v3) (pred_8 ?v13) 
                   (pred_10 ?v4) (pred_4 ?v2))
:effect (and  (pred_6 ?v4) (not (pred_10 ?v4))))


(:action op_1
:parameters (?v13 ?v8)
:precondition (and (pred_12 ?v13) (pred_12 ?v8)
               (pred_8 ?v13) (pred_9 ?v13 ?v8) (pred_6 ?v8))
:effect (and (pred_8 ?v8) (not (pred_8 ?v13))))

(:action op_3
:parameters (?v13 ?v2)
:precondition (and (pred_12 ?v13) (pred_11 ?v2) 
                  (pred_8 ?v13) (pred_5 ?v2 ?v13) (pred_3 ))
:effect (and (pred_4 ?v2)
   (not (pred_5 ?v2 ?v13)) (not (pred_3 ))))


(:action op_4
:parameters (?v13 ?v6 ?v11)
:precondition (and (pred_12 ?v13) (pred_11 ?v6) (pred_11 ?v11)
                  (pred_8 ?v13) (pred_4 ?v11) (pred_5 ?v6 ?v13))
:effect (and (pred_4 ?v6) (pred_5 ?v11 ?v13)
        (not (pred_4 ?v11)) (not (pred_5 ?v6 ?v13))))

(:action op_2
:parameters (?v13 ?v2)
:precondition (and (pred_12 ?v13) (pred_11 ?v2) 
                  (pred_8 ?v13) (pred_4 ?v2))
:effect (and (pred_3 ) (pred_5 ?v2 ?v13) (not (pred_4 ?v2)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_05 obj_11 obj_09 obj_02 obj_03 obj_06 obj_08 obj_01
    obj_12 obj_07
    obj_13 obj_04
    )

    (:init
       (pred_3)

       (pred_12 obj_10)
       (pred_12 obj_05)
       (pred_12 obj_11)
       (pred_12 obj_09)
       (pred_12 obj_02)
       (pred_12 obj_03)
       (pred_12 obj_06)
       (pred_12 obj_08)
       (pred_12 obj_01)
       (pred_7 obj_12)
       (pred_7 obj_07)
       (pred_11 obj_13)
       (pred_11 obj_04)

       (pred_9 obj_10 obj_09)
       (pred_9 obj_10 obj_05)
       (pred_9 obj_05 obj_02)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_05 obj_10)
       (pred_9 obj_11 obj_03)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_09 obj_06)
       (pred_9 obj_09 obj_02)
       (pred_9 obj_09 obj_10)
       (pred_9 obj_02 obj_08)
       (pred_9 obj_02 obj_03)
       (pred_9 obj_02 obj_05)
       (pred_9 obj_02 obj_09)
       (pred_9 obj_03 obj_01)
       (pred_9 obj_03 obj_11)
       (pred_9 obj_03 obj_02)
       (pred_9 obj_06 obj_08)
       (pred_9 obj_06 obj_09)
       (pred_9 obj_08 obj_01)
       (pred_9 obj_08 obj_02)
       (pred_9 obj_08 obj_06)
       (pred_9 obj_01 obj_03)
       (pred_9 obj_01 obj_08)
       (pred_10 obj_03)
       (pred_10 obj_02)
       (pred_2  obj_03 obj_12)
       (pred_2  obj_02 obj_07)
       (pred_6 obj_10)
       (pred_6 obj_05)
       (pred_6 obj_11)
       (pred_6 obj_09)
       (pred_6 obj_06)
       (pred_6 obj_08)
       (pred_6 obj_01)

       (pred_1  obj_13 obj_12)
       (pred_1  obj_04 obj_07)
       (pred_5 obj_13 obj_10)
       (pred_5 obj_04 obj_01)
       (pred_8 obj_01)
    )

    (:goal (and
       (pred_5 obj_13 obj_05)
       (pred_5 obj_04 obj_06)
    ))
(:constraints
  (always (not (pred_8 obj_03)))
)
)

; plan
1. (op_1 obj_01 obj_08)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_08)
   goals met: 0 of 2
2. (op_1 obj_08 obj_06)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_06)
   goals met: 0 of 2
3. (op_1 obj_06 obj_09)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_09)
   goals met: 0 of 2
4. (op_1 obj_09 obj_10)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_10)
   goals met: 0 of 2
5. (op_3 obj_10 obj_13)
   deleted: (pred_5 obj_13 obj_10) (pred_3)
   added: (pred_4 obj_13)
   goals met: 0 of 2
6. (op_1 obj_10 obj_09)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_09)
   goals met: 0 of 2
7. (op_1 obj_09 obj_06)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_06)
   goals met: 0 of 2
8. (op_1 obj_06 obj_08)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_08)
   goals met: 0 of 2
9. (op_1 obj_08 obj_01)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_01)
   goals met: 0 of 2
10. (op_4 obj_01 obj_04 obj_13)
   deleted: (pred_4 obj_13) (pred_5 obj_04 obj_01)
   added: (pred_4 obj_04) (pred_5 obj_13 obj_01)
   goals met: 0 of 2
11. (op_1 obj_01 obj_08)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_08)
   goals met: 0 of 2
12. (op_5 obj_08 obj_02 obj_04 obj_07)
   deleted: (pred_10 obj_02)
   added: (pred_6 obj_02)
   goals met: 0 of 2
13. (op_1 obj_08 obj_06)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_06)
   goals met: 0 of 2
14. (op_2 obj_06 obj_04)
   deleted: (pred_4 obj_04)
   added: (pred_3) (pred_5 obj_04 obj_06)
   goals met: 1 of 2
15. (op_1 obj_06 obj_08)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_08)
   goals met: 1 of 2
16. (op_1 obj_08 obj_01)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_01)
   goals met: 1 of 2
17. (op_3 obj_01 obj_13)
   deleted: (pred_5 obj_13 obj_01) (pred_3)
   added: (pred_4 obj_13)
   goals met: 1 of 2
18. (op_1 obj_01 obj_08)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_08)
   goals met: 1 of 2
19. (op_1 obj_08 obj_02)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_02)
   goals met: 1 of 2
20. (op_1 obj_02 obj_05)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_05)
   goals met: 1 of 2
21. (op_2 obj_05 obj_13)
   deleted: (pred_4 obj_13)
   added: (pred_3) (pred_5 obj_13 obj_05)
   goals met: 2 of 2
